
INSERT INTO public.role(role_name) VALUES ('USER') ON CONFLICT (role_name) DO NOTHING;
INSERT INTO public.role(role_name) VALUES ('ADMIN') ON CONFLICT (role_name) DO NOTHING;

INSERT INTO public.news (id, title, date, url, body, author)
VALUES
    (1, 'Заголовок новости 1', '2023-10-26', '/api/image/2', 'Текст новости 1', 'Автор 1'),
    (2, 'Заголовок новости 2', '2023-10-25', '/api/image/3', 'Текст новости 2', 'Автор 2'),
    (3, 'Заголовок новости 3', '2023-10-24', '/api/image/4', 'Текст новости 3', 'Автор 3'),
    (4, 'Заголовок новости 4', '2023-10-23', '/api/image/1', 'Текст новости 4', 'Автор 4'),
    (5, 'Заголовок новости 5', '2023-10-22', '/api/image/5', 'Текст новости 5', 'Автор 5'),
    (6, 'Заголовок новости 6', '2023-10-21', '/api/image/6', 'Текст новости 6', 'Автор 6'),
    (7, 'Заголовок новости 7', '2023-10-20', '/api/image/7', 'Текст новости 7', 'Автор 7'),
    (8, 'Заголовок новости 8', '2023-10-19', '/api/image/8', 'Текст новости 8', 'Автор 8'),
    (9, 'Заголовок новости 9', '2023-10-18', '/api/image/9', 'Текст новости 9', 'Автор 9'),
    (10, 'Заголовок новости 10', '2023-10-17', '/api/image/10', 'Текст новости 10', 'Автор 10'),
    (11, 'Заголовок новости 11', '2023-10-16', '/api/image/1', 'Текст новости 11', 'Автор 11'),
    (12, 'Заголовок новости 12', '2023-10-15', '/api/image/2', 'Текст новости 12', 'Автор 12'),
    (13, 'Заголовок новости 13', '2023-10-14', '/api/image/3', 'Текст новости 13', 'Автор 13'),
    (14, 'Заголовок новости 14', '2023-10-13', '/api/image/4', 'Текст новости 14', 'Автор 14'),
    (15, 'Заголовок новости 15', '2023-10-12', '/api/image/5', 'Текст новости 15', 'Автор 15'),
    (16, 'Заголовок новости 16', '2023-10-11', '/api/image/6', 'Текст новости 16', 'Автор 16'),
    (17, 'Заголовок новости 17', '2023-10-10', '/api/image/7', 'Текст новости 17', 'Автор 17'),
    (18, 'Заголовок новости 18', '2023-10-09', '/api/image/8', 'Текст новости 18', 'Автор 18'),
    (19, 'Заголовок новости 19', '2023-10-08', '/api/image/9', 'Текст новости 19', 'Автор 19'),
    (20, 'Заголовок новости 20', '2023-10-07', '/api/image/10', 'Текст новости 20', 'Автор 20')
ON CONFLICT (id) DO NOTHING;




INSERT INTO public.coordinate(coordinate_id, x, y, description, type) VALUES
(1, 55.7515, 37.5738, 'Москва', 'город'),
(2, 55.762200, 37.617300, 'Краснопресненская', 'район'),
(3, 55.754814, 37.628369, 'Тверская', 'улица'),
(4, 55.758651, 37.617085, 'Площадь Революции', 'площадь'),
(5, 55.745884, 37.565125, 'Кремль', 'исторический'),
(6, 55.758472, 37.602304, 'ГУМ', 'торговый центр'),
(7, 55.769126, 37.635222, 'Цветной бульвар', 'бульвар'),
(8, 55.750446, 37.618738, 'Петровка', 'улица'),
(9, 55.775115, 37.631886, 'Синдикат', 'жилой район'),
(10, 55.747990, 37.501149, 'Варшавское шоссе', 'шоссе')
ON CONFLICT (coordinate_id) DO NOTHING;
